onandoffables/avrpi-tools/install/arduino/boards.txt
##############################################################

avrm8.name=AVRM328 ATmega328p @ 8MHz

avrm8.upload.using=linuxgpio
avrm8.upload.protocol=linuxgpio
avrm8.upload.maximum_size=32768
avrm8.upload.speed=57600
avrm8.upload.disable_flushing=true

avrm8.bootloader.low_fuses=0xE7
avrm8.bootloader.high_fuses=0xDA
avrm8.bootloader.extended_fuses=0x07
avrm8.bootloader.path=atmega
avrm8.bootloader.file=ATmegaBOOT_168_atmega328.hex
avrm8.bootloader.unlock_bits=0x3F
avrm8.bootloader.lock_bits=0x0F

avrm8.build.mcu=atmega328p
avrm8.build.f_cpu=8000000L
avrm8.build.core=arduino
avrm8.build.variant=standard

##############################################################

avrm12.name=AVRM328 ATmega328p @ 12MHz

avrm12.upload.using=linuxgpio
avrm12.upload.protocol=linuxgpio
avrm12.upload.maximum_size=32768
avrm12.upload.speed=57600
avrm12.upload.disable_flushing=true

avrm12.bootloader.low_fuses=0xE7
avrm12.bootloader.high_fuses=0xDA
avrm12.bootloader.extended_fuses=0x07
avrm12.bootloader.path=atmega
avrm12.bootloader.file=ATmegaBOOT_168_atmega328.hex
avrm12.bootloader.unlock_bits=0x3F
avrm12.bootloader.lock_bits=0x0F

avrm12.build.mcu=atmega328p
avrm12.build.f_cpu=12000000L
avrm12.build.core=arduino
avrm12.build.variant=standard

##############################################################

avrm32u4.name=AVRM32U4 ATmega32U4 @ 8MHz

avrm32u4.upload.using=linuxgpio
avrm32u4.upload.protocol=linuxgpio
avrm32u4.upload.maximum_size=32768
avrm32u4.upload.speed=57600
avrm32u4.upload.disable_flushing=true

avrm32u4.bootloader.low_fuses=0xff
avrm32u4.bootloader.high_fuses=0xd8
avrm32u4.bootloader.extended_fuses=0xcb
avrm32u4.bootloader.path=caterina
avrm32u4.bootloader.file=Caterina-Leonardo.hex
avrm32u4.bootloader.unlock_bits=0x3F
avrm32u4.bootloader.lock_bits=0x2F

avrm32u4.build.mcu=atmega32u4
avrm32u4.build.f_cpu=8000000L
avrm32u4.build.vid=0x2341
avrm32u4.build.pid=0x8036
avrm32u4.build.core=arduino
avrm32u4.build.variant=leonardo

##############################################################

gert328.name=Gertboard with ATmega328 (GPIO)

gert328.upload.using=linuxgpio
gert328.upload.protocol=linuxgpio
gert328.upload.maximum_size=32768
gert328.upload.speed=57600
gert328.upload.disable_flushing=true

gert328.bootloader.low_fuses=0xE7
gert328.bootloader.high_fuses=0xDA
gert328.bootloader.extended_fuses=0x07
gert328.bootloader.path=atmega
gert328.bootloader.file=ATmegaBOOT_168_gert328.hex
gert328.bootloader.unlock_bits=0x3F
gert328.bootloader.lock_bits=0x0F

gert328.build.mcu=atmega328p
gert328.build.f_cpu=12000000L
gert328.build.core=arduino
gert328.build.variant=standard


##############################################################

gert168.name=Gertboard with ATmega168 (GPIO)

gert168.upload.using=linuxgpio
gert168.upload.protocol=linuxgpio
gert168.upload.maximum_size=16384
gert168.upload.speed=57600
gert168.upload.disable_flushing=true

gert168.bootloader.low_fuses=0xE7
gert168.bootloader.high_fuses=0xDA
gert168.bootloader.extended_fuses=0x07
gert168.bootloader.path=atmega
gert168.bootloader.file=ATmegaBOOT_168_gert168.hex
gert168.bootloader.unlock_bits=0x3F
gert168.bootloader.lock_bits=0x0F

gert168.build.mcu=atmega168
gert168.build.f_cpu=12000000L
gert168.build.core=arduino
gert168.build.variant=standard

##############################################################

gertduino48.name=Gertuino ATmega44 (GPIO)

gertduino48.upload.using=linuxgpio
gertduino48.upload.protocol=linuxgpio
gertduino48.upload.maximum_size=4096
gertduino48.upload.speed=57600
gertduino48.upload.disable_flushing=true

gertduino48.bootloader.low_fuses=0xE2
gertduino48.bootloader.high_fuses=0xDF
gertduino48.bootloader.extended_fuses=0x01
gertduino48.bootloader.path=atmega
gertduino48.bootloader.file=ATmegaBOOT_48_gert48.hex
gertduino48.bootloader.unlock_bits=0x3F
gertduino48.bootloader.lock_bits=0x0F

gertduino48.build.mcu=atmega48p
gertduino48.build.f_cpu=8000000L
gertduino48.build.core=arduino
gertduino48.build.variant=standard


##############################################################

gertduino328.name=Gertuino with ATmega328 (GPIO)

gertduino328.upload.using=linuxgpio
gertduino328.upload.protocol=linuxgpio
gertduino328.upload.maximum_size=32768
gertduino328.upload.speed=57600
gertduino328.upload.disable_flushing=true

gertduino328.bootloader.low_fuses=0xE7
gertduino328.bootloader.high_fuses=0xDA
gertduino328.bootloader.extended_fuses=0x07
gertduino328.bootloader.path=atmega
gertduino328.bootloader.file=ATmegaBOOT_168_gert328.hex
gertduino328.bootloader.unlock_bits=0x3F
gertduino328.bootloader.lock_bits=0x0F

gertduino328.build.mcu=atmega328p
gertduino328.build.f_cpu=16000000L
gertduino328.build.core=arduino
gertduino328.build.variant=standard


##############################################################

gertduino168.name=Gertduino with ATmega168 (GPIO)

gertduino168.upload.using=linuxgpio
gertduino168.upload.protocol=linuxgpio
gertduino168.upload.maximum_size=16384
gertduino168.upload.speed=57600
gertduino168.upload.disable_flushing=true

gertduino168.bootloader.low_fuses=0xE7
gertduino168.bootloader.high_fuses=0xDA
gertduino168.bootloader.extended_fuses=0x07
gertduino168.bootloader.path=atmega
gertduino168.bootloader.file=ATmegaBOOT_168_gert168.hex
gertduino168.bootloader.unlock_bits=0x3F
gertduino168.bootloader.lock_bits=0x0F

gertduino168.build.mcu=atmega168
gertduino168.build.f_cpu=16000000L
gertduino168.build.core=arduino
gertduino168.build.variant=standard

##############################################################

# See: http://code.google.com/p/arduino/wiki/Platforms

##############################################################

uno.name=Arduino Uno
uno.upload.protocol=arduino
uno.upload.maximum_size=32256
uno.upload.speed=115200
uno.bootloader.low_fuses=0xff
uno.bootloader.high_fuses=0xde
uno.bootloader.extended_fuses=0x05
uno.bootloader.path=optiboot
uno.bootloader.file=optiboot_atmega328.hex
uno.bootloader.unlock_bits=0x3F
uno.bootloader.lock_bits=0x0F
uno.build.mcu=atmega328p
uno.build.f_cpu=16000000L
uno.build.core=arduino
uno.build.variant=standard

